---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextAlignHorz
source: html/995490ee-71aa-f11d-ba07-cb39a774c350.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextAlignHorz Property

"Horizontal Align"

## Syntax (C#)
```csharp
public static ForgeTypeId TextAlignHorz { get; }
```